{"meta":{"title":"Hcat's Blog","subtitle":"若非生活所迫，谁愿一身才华","description":"爱折腾的程序媛一枚","author":"Hcat","url":"http://blog.hcat.work","root":"/"},"pages":[{"title":"Hcat's Blog | 404","date":"2020-04-25T06:37:09.232Z","updated":"2020-04-25T06:37:09.232Z","comments":true,"path":"404.html","permalink":"http://blog.hcat.work/404.html","excerpt":"","text":""},{"title":"","date":"2020-04-25T13:07:54.242Z","updated":"2020-04-25T13:07:54.242Z","comments":true,"path":"Links/index.html","permalink":"http://blog.hcat.work/Links/index.html","excerpt":"","text":""},{"title":"","date":"2020-04-25T13:08:52.791Z","updated":"2020-04-25T13:08:52.791Z","comments":false,"path":"categories/index.html","permalink":"http://blog.hcat.work/categories/index.html","excerpt":"","text":""},{"title":"","date":"2020-04-25T13:08:35.552Z","updated":"2020-04-25T13:08:35.552Z","comments":false,"path":"tags/index.html","permalink":"http://blog.hcat.work/tags/index.html","excerpt":"","text":""}],"posts":[{"title":"咖啡与香烟","slug":"咖啡与香烟","date":"2020-04-24T04:00:04.000Z","updated":"2020-04-24T04:00:04.000Z","comments":true,"path":"2020/04/24/咖啡与香烟/","link":"","permalink":"http://blog.hcat.work/2020/04/24/%E5%92%96%E5%95%A1%E4%B8%8E%E9%A6%99%E7%83%9F/","excerpt":"","text":"我六岁时，爸爸在一个泳池的小吃店工作，离特拉维夫的某个海滩不远。每天清晨五点三十分，他就从家里出发去那泳池，游两公里，在温暖的仅供内部成员使用的休息室淋浴，然后上班。他晚上九点才到家。每天十四小时，每周七天，搬运汽水饮料，烤三明治，在戈登海滩边的泳池小吃店用锃亮的玻璃杯煮咖啡。 多年后，爸爸总说那是他一生中最棒的时光，陶醉地回忆咸咸的海风与酒吧里卖的咖啡、进口香烟的味道在他的肺里混合在一起。咖啡、香烟和大海一直是父亲最爱的三样东西。 对我来说，那些日子就没那么开心了。爸爸下班回来时，我已经睡了，除了星期六和妈妈一起去泳池边找他，我一直没机会见他。倒不是说我对此心怀怨恨。六岁的孩子无法为自己想象一个不同的世界，一个父亲有更多时间陪伴他的世界；他只是接受现实。但我还是很想爸爸。妈妈看到我这样，就建议我每天早晨跟爸爸一起去泳池游个泳，然后从那儿打车去学校。 关于晨泳，除了每天跳进冰冷的水里忍受寒冷之外，其他我什么都不记得了，但和爸爸一起开车去泳池的回忆很清晰。我们开着银色的标致五〇四，外面天还没亮，爸爸摇下车窗，抽着健牌香烟，描述存在于其他维度的平行宇宙。 平行宇宙中的一切都和我们这儿完全一样——同样的路，同样的红绿灯，爸爸嘴角叼着同样的香烟——除了一个细微的差别。而关于这个差别，爸爸每天早上的说辞都不一样——每天换一样与我们这个宇宙不一样的东西。看，我们在平行宇宙，在同一个十字路口等红绿灯，只是在这个宇宙中，我们不是开银色的标致，而是骑一条龙。另一个平行宇宙中，我褪了色的运动裤下面藏着腮，很快我就能像鱼一样在水下呼吸。 我九岁时，父亲找了份新工作。他不用再那样早起，晚上我们也能一起吃晚饭，看看晚间新闻。我从父母家中搬出去时二十二岁，但我坚持每周去看望他们两次，周六则和爸爸一起去他曾工作过的泳池游泳。我四十三岁时，父亲被诊断出癌症。是五十年吸烟所致的舌癌。医生们发现时，他的病已到晚期，虽然我们从未谈起此事，但我们都很清楚，他快要死了。 我每周一带他去接受理疗，我们坐在候诊室里，等着见操英国口音的理疗师，爸爸有时仍谈论平行宇宙，那里的一切都和我们这儿完全一样，只有一点不同。比如，那里的狗能讲话。或者人人会读心术。或者天是紫色的，甜菜根的那种深紫，奶白色的云朵丛丛飘过，它们看起来很可口。 每次治疗结束，理疗师都会教我如何挽着父亲的胳膊一起散步，以及万一他失去平衡，我该怎么做。在回家的路上，我们快走到所罗门国王大街和阿洛佐罗夫大街的街角时，爸爸总会停下来。“你闻到了吗？”他指着拐角一家新开的咖啡馆说，“光是闻闻味道，我就能告诉你，这家的咖啡是城里最棒的。”在他患病的这个阶段，他的舌癌已到晚期，他再也不能吃东西，也不能喝水。所有的食物和液体都通过一根透明的塑料管直接被送到他的胃里。 一个周一，做完理疗后，我们路过所罗门国王大街和阿洛佐罗夫大街拐角处的咖啡馆。父亲不像往常一样只是停下来称赞一番，而是建议我们进去喝杯咖啡。“爸爸，”我犹豫片刻后说道，“你喝不了东西。肿瘤堵住了你的食道。”“我知道，”他拍拍我的后背，“但你可以。” 我们挑了一张人行道拐角处的桌子。我向漂亮的女服务员点了一杯拿铁和一杯水。她问我的父亲想要什么，他要了双份浓缩咖啡。我瞪着他——疑惑不解——他笑着耸耸肩。女服务员注意到我爸爸脸上内疚的微笑，用疑问的眼光看了我一眼。不知该说什么，我点了块燕麦饼干。 咖啡端来前，我们沉默地坐着。我想问父亲为什么他要点咖啡，是不是因为这个服务员很漂亮，但我什么都没说。爸爸从衬衫口袋里掏出烟盒和放在眼镜盒里的打火机，把它们放在桌上。我们等待着。 几分钟后，女服务员端着我们点的东西回来了。她把东西放到桌上：一杯拿铁，一杯水，我面前的盘子里有一块饼干，爸爸面前有一杯双份浓缩咖啡。咖啡的芳香从杯中蒸腾升起。我想喝，但当着爸爸的面这么做似乎不太合适，所以我只是一直盯着它。这时，我透过眼角的余光看到父亲迅速拿起桌上那杯双份浓缩咖啡，一口喝了下去。 这不可能。我知道这不可能。毕竟，我在肿瘤科医生的办公室里亲眼看到医生为我和母亲指出 X 光片中堵塞食道的肿瘤，就像华夫饼蛋卷上的一勺香草冰淇淋。她当时说，我的父亲再也不能喝东西了。而现在，一个晴好的日子，我们一起坐在这个时髦的咖啡馆，我仍盯着我那杯蒸汽腾腾的咖啡，而他坐在我旁边，消灭了他的双份浓缩咖啡后露出微笑。 有那么一瞬间，我想，也许我们在一个平行世界，也许在我还是个小男孩时，他就给我讲了足够多的故事，使我能够在我们这个宇宙疼痛的中心扯开一个洞，洞将我们吸入一个平行宇宙，这个宇宙在各方面都和我们自己的宇宙一模一样，只有一处不同——在这个宇宙，爸爸可以尽情吃喝，也不会在几个月后死去。 滚烫的咖啡顺着父亲的气管滑进肺里。然后父亲呛到了。他站在咖啡馆中央，双手掐住自己的喉咙。他发出湿漉漉的呼哧呼哧的声音，一个肺里汹涌着热咖啡的人发出的声音，很可怕。女服务员惊恐地看着。坐在我们旁边桌子的一个戴眼镜男子跳起来，问我父亲是否需要帮助。 我只是坐在那里，一动不动。刚才我与父亲共同的平行宇宙已经消失，我被送回一个更糟糕的宇宙。爸爸开始漱口，几秒钟后俯身往地上吐了口唾沫，把他满肺的意式浓咖啡都排干。做完这一切，他从椅子上坐起，好像什么事也没发生，虽然那摊咖啡和痰离他只几厘米远，然后给自己点了支烟。坐在我们周围的人一直盯着他，迷迷糊糊。“我说什么来着？”他对我微笑，烟从鼻孔里喷出，“城里最好的咖啡。”","categories":[],"tags":[]},{"title":"为你点亮一盏灯","slug":"为你点亮一盏灯","date":"2020-04-21T06:03:54.000Z","updated":"2020-04-21T06:03:54.000Z","comments":true,"path":"2020/04/21/为你点亮一盏灯/","link":"","permalink":"http://blog.hcat.work/2020/04/21/%E4%B8%BA%E4%BD%A0%E7%82%B9%E4%BA%AE%E4%B8%80%E7%9B%8F%E7%81%AF/","excerpt":"","text":"夜深时，有没有人为你点亮一盏灯？ 他们相识于一间音乐教室，那时，她是老师，他是学生。 大学毕业，进出版业当编辑第三年，因为分租的公寓里有一架房东留下的钢琴，他突然心生学钢琴的念头。年近三十岁，身高185，看起来像是运动员的大男人，害羞地走进了那家小区里的音乐教室，与柜台接待人员谈妥上课的价钱与课时数，便被请入教室内的小包间。有一个当值的老师可以当场试教，接待人员事先声明，如果觉得试教的老师不合适，还可以再换人。 那个小包间里有个长发女孩正在等待。 他的高大映照出她的娇小，穿着碎花裙，戴金框眼镜，长发如瀑的女孩，不，该说是女人，淡淡妆容，微笑浅浅。老师自称姓谢，他说自己姓李，感觉自己大手大脚显得空间很小，老师坐在琴凳上教学，问他能不能读五线谱，他说以前学校学过，但恐怕需要复习，老师概要地为他复习，他很快就能读谱了。 一小时感觉转瞬即逝，下课前谢老师问他，有没有喜欢听的钢琴曲，可以弹给他听，他笑说自己不懂，老师弹什么都好，老师便说，那我弹莫扎特。 曲名没听懂，倒是被老师的琴艺给惊呆了，看起来清秀温和的老师，炫技般弹奏了一个听起来就很困难的曲子，琴音高妙，双手若蝶，起伏翻飞，目不暇接。 不知为何，他感觉有点悲伤。 琴艺这样好的人，应该去当音乐家吧，他想着，老师以前还是学生时，一定也曾经是很有天分的孩子，是什么因素让她后来没有当上音乐家，而成为按钟点收费，在小区钢琴教室教授儿童或像他这种成人初级钢琴的老师呢？不知为何，老师清新的脸庞仿佛写满了故事一般，浮现出一种隐约的沧桑。或许是自己多想了。 他们最初就像寻常的师生，他在家照谱练习，牙牙学语似的。他喜欢谢老师在作业本上娟秀的字迹，交错着他自己潦草的笔记，彷彿在作业本上对话。当回到钢琴教室，他正襟危坐，小心翼翼地弹奏。 他没有天分，学习又太晚，但都无所谓，此后他的生活重心似乎都围绕着这每周一次的钢琴课，期待着老师听他弹完练习曲，为他演奏一个曲子，感觉像是他自己独享的演奏会，他望着老师的侧脸，看她扬起手，飞舞指尖，感受她努力要传达给他的，关于音乐的美好。 他鼓起勇气约老师出去，已经是学习三个月之后了，公司举办原著小说搭配电影放映会，贵宾席座位两份，“想邀请老师一起观赏。”他将票卷与一张卡片放在信封里，恭敬地递给她，老师问了日期，偏着头想了想，微笑说，“那天好像没事，就一起去吧。” 七点钟的电影，放映完毕时老师的脸上流着泪水，他没敢动弹，等到大家都散场了，他们才离开，“要不要一起吃点东西？”他问，老师点点头。 他不知道自己哪来的胆子，在商店街走着的时候，就去握了老师的手，那双在琴键上轻舞飞扬的手，握起来冰凉柔软，老师没拒绝，他就继续握着，想把她的手握暖。 因为握着手不想放开，他们沿着商店街一路走，走到了附近的小公园。 公园里有小孩玩的荡秋千，老师开心地荡着秋千，他帮老师把秋千推高，让她荡下来，老师开心地大笑。一次一次推高，一次一次来回摆荡，仿佛自有旋律，他赫然感觉自己虽然跟老师说过的话不多，却好像能体会到老师的某种心绪，这是不是叫做心电感应，或者某种频道相近？他想起之前分手的女友总是怨他，“没有情调”，他不知道老师怎么看待他，但他知道自己可以带给她快乐。 在皎洁的月光下，他们在公园的长椅上并排坐着，空旷无人的夜间公园、路灯，荡秋千，溜滑梯，感觉他们像是结婚多年的夫妻，趁着孩子们都睡了，在自家附近的公园散步。 “我喜欢你。”他直接地表白了。 “为什么呢？”她问。 “我第一次听你弹琴就喜欢上你了，我觉得我们之间有共鸣。”他说。 她轻声笑了起来，他脸红了，难道是因为共鸣的词太老套了吗？ “我喜欢你的说法。”她说。说完，就把手心盖在他的手背上。 “跟我交往吧！”他说。 那夜散步送她回她的住处，走了好远好远。途中，她悠悠说起自己在四岁那年被父母送去学钢琴，她前二十年人生都为了做钢琴家而活，直到有一次钢琴大赛之前，右手拇指突然疼痛难忍，不听使唤，她放弃比赛，开始就医，从手痛变成全身关节疼痛，到大医院作了各种检查，检查出是类风湿性关节炎，一种自体免疫疾病，只能控制，无法治愈。 度过最初发病期，靠着意志力复原身体，她还是可以继续弹琴，但已经受损的关节脆弱，手指无法产生连续爆发力，她知道自己再也无法成为顶尖的钢琴家了。二十多年来她活着只为了一个目标，但那个目标破灭了。 “那真是瞬间世界就暗掉了。彻底的黑暗，看不到一点光。” 她在家里荒废了很久，不出门、不打扮、没工作，连男朋友都离开她了，父母也不知道怎么面对她的失落。她就这样，度过了无所事事的六年。 直到去年初，父亲因病倒下，家里耗尽了积蓄，她得出门赚钱了，她才开始在钢琴教室上课，每周五天，在三个教室间流转。学生从小到老，什么年纪的学生都有，她不知道自己原来这么适合当老师，后来她每次上课结束前，都会为学生弹一奏一曲。她说，“我还可以弹琴，但不再为了比赛或表演。这样让我能够好好活下去。” “我有病喔，这个病不会痊愈，每两个月都要进医院。每天要吃很多颗药丸。你确定要跟一个病人交往吗？”她说。 他一直没有放开她的手，在她说着自己的故事时，他一直流着眼泪，不敢让她发现。 “我也是有病的人”，他说。 “二十岁那年，我在客厅，看到了上吊的父亲。那之后，我从没有让客厅的灯熄灭过。我看见你的时候，看到的就是一个心里的灯曾经熄灭的人。”他说。 “跟我交往吧。我们一起护住那盏灯。” 他们断续又说了很多话，把来时路又走回了头，还没有决定要到谁的家，最后他们把夜路走到天明，然后各自回家去。期待另一个明天。 当生命走到黑暗期，你一定非常孤独，或许会有一个人出现，为你点亮一盏灯，也或许不会有那个人，但如果有了那个人，那么你不但要珍惜他，更要珍惜你自己。","categories":[],"tags":[{"name":"文章","slug":"文章","permalink":"http://blog.hcat.work/tags/%E6%96%87%E7%AB%A0/"}]},{"title":"越长大，越沉默","slug":"越长大,越沉默","date":"2020-04-12T14:16:11.000Z","updated":"2020-04-12T14:16:11.000Z","comments":true,"path":"2020/04/12/越长大,越沉默/","link":"","permalink":"http://blog.hcat.work/2020/04/12/%E8%B6%8A%E9%95%BF%E5%A4%A7,%E8%B6%8A%E6%B2%89%E9%BB%98/","excerpt":"","text":"你见过凌晨4点的祖安吗？ 让我沉默的4句话—— 观众：“会弹成都吗？” 路人：“你身高多少？” 朋友：“最近手头有点紧，借我点钱。” 同事：“编辑部专栏交稿了。” 朋友：刘德华唱“啊哈~给我一杯忘情水……”，请问这个“啊哈”是谁？ 我：不知道，是谁？ 朋友：他妈妈。 我：为什么？ 朋友：你没听过吗？“啊哈这个人就是娘，啊哈这个人就是妈……” 我：…… 同事：你是学什么专业的啊？ 我：刑事侦查。 同事：哦！就是学抓小偷的吧！ 我：…… 上学时。 母亲：你看看那谁谁家的孩子，都知道做做家务帮忙分担，你就不能像人家学学？ 我：好吧，扫把放下，我来扫地。 母亲：一边去，不用你来，你把书读好我就谢天谢地了。 我：…… 朋友：我男朋友是个畜生，他XXX了，又XXX了，一点都不考虑我的感受。 我：早点分手吧。 朋友：可是我还是很喜欢他啊。 我：那再将就将就。 朋友：可是我越想越气，怎么都原谅不了他。 我：…… 朋友发朋友圈：有些人真不知道自己几斤几两？也不想想，疫情期间我都这么无聊了，你找我聊天我还不回你消息，你还看不出来自己多惹人厌吗？ 我私聊安慰他：别跟这些人一般见识，动了火气不好，不过做得很对，我支持你。 朋友并没有回我消息。 你失恋是怎么熬过来的？ 我已经很久没碰感情了，说是不乐意碰，但其实是不敢碰。 周六收到朋友信息，他挺不好意思地问：你失恋的时候，是怎样熬过来的？ 原本我还有很多快乐想要跟他分享，看到屏幕上出现这句话，我保持沉默，趴在桌上缓了许久，不知道该怎么去回答。 爱情和失恋，这些年我常常拥有，失恋也是家常便饭，可能跟我性格有关系，也可能跟我恋爱方式有关系，我会强加在对方身上，所有我觉得好的东西，哪怕他不需要，我都会希望他拥有。 可恋爱中的我总是忘记，人都不喜欢被约束，不是任何我觉得好的东西，别人也觉得好。我自以为的好，当真是我自以为的好。 我曾经有着很喜欢的男生，我每天都给他准备各种零食，平时我看到什么有趣的也都会给他买。很多我自己不舍得买的东西，给他都愿意。 这样的生活没持续多久，他有天很冷静很冷静地跟我说，曲尚，我是男生，你能不能别什么都留给我，对自己好点行不行，让我多照顾你一点。 我听着觉得委屈，低头沉默，无话可话。 我将我的行为理解成我过于爱这个人，在他离开那天，我告诉自己，下次再谈恋爱时，可千万别爱太满。 人终究是会打脸的，我们因为某件事情复合后，我表达爱意的方式依旧像当初一样。 所以很可惜，我们没能走得长远，爱留在那短短的日子中。 我不得不承认我快乐过，也不得不承认在这段感情中有所遗憾，他算是我的意难平。 我花了很长时间走出来，但说实话，他还在我心里。我们所拥有的回忆太多，无法做到真的彻底忘却，我唯一能做的大概就是不去提起，将他放在我心里的某个角落。 当我听到朋友问的问题时，我满脑子都是他，但幸好，我现在还算快乐，他无法再影响我的情绪，只是再提起他，提起爱情，我还是会沉默，不知怎么开口。 无声惊雷最近回看金宇澄老师的《繁花》，感慨“不响”一词之妙。诸多心理，或起伏波澜，或细水长流，或蓬乱慌张，或安然若泰，都寄放一个“不响”里头。管你表面花样繁冗，吾自有见解。不多讲，一搭手，合不合算，心早有数。嘈杂的市井，短暂沉默的片刻，一切恰到好处。 现实生活，也是这样。鲁迅有句诗“于无声处听惊雷”，一种解释是，表面什么声音都没有，但有事要发生。这里面有凭经验的预判，也有脑海的想象。接触的人多了，便发现各种有趣人生。有人穷装高调，有人闷声发财，不同人身上，有不同标签。不过，人实在复杂，讲不透，穷其词句，只能看几个切面。 想起侯孝贤的《悲情城市》里，梁朝伟扮演的林文清，虽然聋哑，但更有真实质感。许多感觉，许多话，你讲不出来的。最多用纸笔，描几个字，传递信息。但大部分想法感情，来不及表现。一切尽在不言中。 生活中的沉默时刻，更多是尴尬和等待。老师上课提问，无人发言。领导询问进度，无人回应。初入某地，人生地不熟，只能沉默。 好在我注意到以后，努力改正沉默的习惯。多活络，多讲话，总是件好事。当然，一切以实际情况为准。比如刚刚，被责编催稿的时候，我选择装傻。 收到请回复在什么群里你不能保持沉默呢？工作群，因为你要回“收到”。 如果你在工作群里保持沉默会怎么样呢？领导会直接私聊你或者一个电话飙到你那里。 所以很多时候，工作群的消息都会优先回复。 利用这一点，我们在前几天“报复”了一把周末沉迷电视剧不回消息的朋友。 起因很简单，我们有个四人群，那天在讨论下次见面要吃什么，一个重要话题，必须全员参与。有一个人一直沉默，但是我在六分钟前还看到她在微博上大骂张贵妃是坏女人。我们三个马上气上心头，在群里进行信息轰炸，她对我们不闻不问，以至于我们怀疑她是不是屏蔽了群消息。 这种朋友很常见，每个聊天小群里总有那么几个。不管什么话题，大家讨论得多热火朝天，她永远潜水，你也不知道她看没看到，是看到了不想参与还是看到了大家已经讨论完了。 为了“报复”这种沉默，我们紧急建了一个：5月北京工作内容分配群，开始表演。 毕竟都是上过班的人了，领导的套路还是很了解的，上来就是一句：进群请回复。然后随机艾特一个人，不到一分钟之后马上跟一句：“下次收到消息要及时回复，希望看到大家认真积极的工作态度。” 考虑到朋友刚刚换公司，还在试用期，为了增加真实度和紧张感，“尤其是没转正的同学~要及时回消息哦，会算在最终考核里的。” 另一个朋友打破独角戏，扮演积极的同事，“收到，X姐，辛苦了[握手]”。 当你打开微信，看到一个这样的群和五条以上的群消息数的时候，多少还是会内心震颤一下。 所以，在问你吃什么的时候，快点出现，吃喝玩乐这样的大事不比工作重要吗，还是和姐妹一起吃喝玩乐！ 灯光暗下来，你会不会抱紧我想来生活中一向是惯于沉默的那个。 最近反倒因为过于活泼，而被曲尚说感觉有点不正常。 很多时候的沉默都是突如其来的，似乎没什么理由。如果偏要说的话，感受最深刻的，应当就是在某一瞬间的当众沉默吧。 比如大家都在KTV里尽情嗨歌的时候，我坐在角落，就突然地沉默了。 比如大家聚在一起喝酒聊天，我坐在位子上，原本是个话唠属性，却突然不知道该怎么开口。 情绪总是莫名其妙的样子，有那么一瞬间，就像想爱却收回了手一般，我想开口说话，但最后还是决定保持沉默。 都说沉默是金，但我也并未因此而暴富。 想起鲁迅先生曾写下这样一句话：“当我沉默的时候，觉得很充实，当我开口说话，就感到了空虚。” 或者是因为在众人的狂欢中，我不晓得要表达些什么吧。即使我也很开心，即使我也不想分别，即使我在心里说了成百上千遍爱你，我也不知道该怎么开口，让这些话拥有声音。 所以，沉默似乎能代替我在当下所有的回答。很难讲这样的做法是不是一种性格缺陷，但在平素，我并未感受到什么特别明显的压抑、悲伤、沮丧。更多的是想要活成一个快乐而自由的好人。 既然如此，不如尊重沉默，尊重那些愿意在吵闹中沉默的人。毕竟，每个人的生活方式和表达都有所不同。 有时候怕的，或许不是沉默，而是不能懂得和允许沉默的背后，还有一些特别的深情。这就像父亲总是在儿女心中以沉默的形象出现，他们总是习惯把爱深藏在心里；就像恋人分手时总是一方先提出来，一方保持沉默，不拒绝也似乎不妥协，或许是在等待从天而降的挽留；就像生气的时候为了不出言伤害到亲密的人，所以只好默默躲到一旁什么都不讲。 所以，或者所有的沉默都是事出有因，而大部分原因，都来自于不知该如何表达的深深的爱意和珍惜。 如果是这样的话，不知道等到灯光黑暗时、雨雪霏霏时、风声萧瑟时，你愿不愿意去主动抱紧，那个总是沉默但却一直陪在你身边，从未离开过的人呢？ 责任编辑：颗馨","categories":[],"tags":[{"name":"文章","slug":"文章","permalink":"http://blog.hcat.work/tags/%E6%96%87%E7%AB%A0/"}]},{"title":"帮助我去好好爱你","slug":"帮助我去好好爱你","date":"2020-04-10T00:34:01.000Z","updated":"2020-04-10T00:34:01.000Z","comments":true,"path":"2020/04/10/帮助我去好好爱你/","link":"","permalink":"http://blog.hcat.work/2020/04/10/%E5%B8%AE%E5%8A%A9%E6%88%91%E5%8E%BB%E5%A5%BD%E5%A5%BD%E7%88%B1%E4%BD%A0/","excerpt":"","text":"恋爱三年，她决定去英国攻读硕士，这一直是她的梦想，以前是苦于经济，后来是因为眷恋爱情，始终无法成行，她常问自己，现在的生活有什么不好，她已经有稳定的工作，他在大学的教职也升等了，住的是父母给的房子，他的性格安定，善于照顾人，感觉会是个好丈夫，好爸爸，他知道她的梦想，鼓励她去求学，可是这一读得多少年才毕业？她都三十岁了，这一耽误，恐怕也成了高龄母亲。父母都劝她别去，这种好男人不多了，等你回来都要四十岁了，还要嫁给谁？ 可是就是因为这份安定，才让她有勇气去实现理想。 经过一年的准备，她申请到理想的学校，拿到了全额奖学金，安排好住宿，收拾行李，就出发了。 现在通讯发达，视讯电话一开，仿佛人就身边，最初，两个人没有什么隔阂。顶多是因为时差，要调整聊天时间，他总是把视讯开着，让她读书的时候可以看到他睡觉的样子，傻傻一个大个子，睡起觉来像熊似的。有时她几乎要伸手去触摸电脑荧屏，仿佛可以摸到他的脸。 冬天的时候，她罹患了抑郁症，以前在国内从没发生过，她慌乱得不得了，她住的城市太冷，食物太难吃，房东脾气坏，邻居也不安好心，不知为何，她眼中所见都是可怕的人事物，她渐渐不出门，没办法上学，再下去恐怕课业就要耽误了。 那时他飞到了她住的地方陪伴她。 “工作不要紧吗？”她问，“都要紧，但是你最要紧。”他说。 有他在的时候，她情绪渐渐好转了，有人张罗吃喝，有人陪伴说话，他陪她穿过雪地，开车去上课，她上课时，他就去校园里的咖啡馆待着，下了课一起回家，去超市采买，自己做饭吃。 好像在家一样的生活。 “我是不是应该放弃学业，看来我不是这块料子。”她懊恼地说。 “看你怎么想，要再试试也可以，身体不是好多了吗？”他说。 她突然对于他即将离开的事感到非常焦虑，又对自己的无能为力感到挫折，什么都是她自己要的，现在却承担不了，想要中断学业，又觉得回去会丢脸。她陷入忧郁的无限回圈。 “要记得，这个不是你，这是抑郁症造成的负面思考，那不是你，不要对自己下判断。”他温柔地说。 她送他上了飞机。 好好坏坏一阵一阵的，勉强度过了冬天。 春天到来，她又病了。 异国的春，到处都人影幢幢，大家都志得意满，只有她形单影只，而且是自己选的孤独。 有一个男同学靠近了她。 男同学以前也是抑郁症患者，他陪她去登山健行。“多晒太阳，多流汗，驱赶忧郁最好了。” 她对男同学没有男女之间的想法，更多是病友间的互助，只是那阵子，她待在户外的时间多，跟男友视讯的时间变少了。男友知道登山的事，也知道那人陪她去看医生，带她去练习瑜伽，“就是像男的闺密。”她说。“没关系，只要你好好的就行。”他说。 以前总觉得他温和，现在想想，他是太温和了。好像连忌妒对他来说都是太过激烈的感受，凡事只要能往好处想，他绝对不往坏处琢磨。 她在抑郁症之中看到了自己的人生问题，童年时母亲多病，父亲在外流连，记忆里忧伤的母亲总是披着父亲的外套，站在窗边沉思，哪里也去不了的母亲，约束不了爱放荡的父亲，母亲荒废了母职，成了一个常年失恋的女人，她就得担起责任，做饭给弟妹吃，整个青春期，她不记得自己有过玩乐的时光。 那一段时间后来好像谁都不记得了，浪子回头的父亲与母亲后来感情很好，谁也不想提起那段往事，于是就好像谁都没有受伤。可是她耿耿于怀。 或许因为那一段回忆，她总是一个始终觉得自己没有被爱够的人，她知道自己被爱着，但他给她的爱是那么温吞吞的，看起来大气，却又像是不在乎不要紧，没有也没关系似的。 她又陷入了忧郁的回圈。 “那不是你，那是抑郁症的思维。”他说，“你要走出那个想法。超越它。” 她忍不住对他生气了。“那不是抑郁症的思维，那是我的创伤，那是我没有痊愈的伤口，那是我没有被满足的需要。”她大叫着。 温和的他忍不住急了，“你要我怎么办，我又不在你身边。” “接受我，我只想要你接受我，接受我的不完美，我的痛苦，我的焦虑，不要跟我说那不是我，不要叫我走出来，我没办法超越。”她哭着说。 她知道自己说的话他听不懂，他的好就好在他不钻牛角尖，他不负面思考，他看什么事都是清澈的，他看到的她也是。 男同学带她去做心理治疗，疗程很贵，她把她珍藏的首饰都卖掉了。 医生没有要她超越，没有要她走出来，医生要她彻底仔细地描述，那两年姊代母职疲惫的生活，以及后来各种心情阴暗的日子，她第一次可以这样畅所欲言，诉说她的悲伤，她的不满，以及她的匮乏。 一次又一次的会谈中，她再一次重新审视她自己的生命，她好像比较清楚为什么她会放弃工作与爱情，飞到英国来。学位并不重要，她得为自己活一次。 她越来越喜欢那个陪她走过大雾的男同学。 有了体悟之后，她觉得她该回家了。 结束最后一次疗程，她向学校办了休学，但预感自己可能也不会再回来，就把家具书本都卖掉了，男同学陪她最后一次散步，她心里没有太多不舍，那份喜欢不代表什么，如果要说治疗有所成效，大概就是她终于明白，有些喜欢不是爱情，以前的她大概这样就陷落了，因为她是个心里有匮乏的人，她看到的人事物都被自己美化过，现在她知道，关于爱情，关于生活，她还得再从头学起。 他到机场去接她，开的是新买的车子，一辆休旅车，她很纳闷为何换了车，他说，“我想以后我们可以去外地旅游，你若喜欢登山，我们也可以去。” 他又说：“我不应该叫你走出来，我应该陪你到处走一走。很抱歉我总是叫你要超越，其实我根本不了解你活在什么样的痛苦里，我不了解，但是我可以学。我不应该叫你要努力，你已经够努力了。让我来帮助你吧，你放轻松，想哭想笑都可以，过去的人生里你太辛苦了。帮助我，我想要接受全部的你，帮助我好好爱你。” 她靠在他的怀里大哭了起来。她突然想起他说过的话，“那不是你，那是抑郁症”。其实他说的又何尝没有道理，可是不管那是什么，重要的是他们在一起，他们会努力一起去面对。","categories":[],"tags":[{"name":"文章","slug":"文章","permalink":"http://blog.hcat.work/tags/%E6%96%87%E7%AB%A0/"}]},{"title":"哀悼日全站自动灰化","slug":"哀悼日全站自动灰化","date":"2020-04-03T17:12:10.000Z","updated":"2020-04-03T17:12:10.000Z","comments":true,"path":"2020/04/04/哀悼日全站自动灰化/","link":"","permalink":"http://blog.hcat.work/2020/04/04/%E5%93%80%E6%82%BC%E6%97%A5%E5%85%A8%E7%AB%99%E8%87%AA%E5%8A%A8%E7%81%B0%E5%8C%96/","excerpt":"","text":"哀悼日全站自动灰化 一般在公祭日或一些影响力很大的伟人逝世或纪念日，作为站长会将网站全站页面变成灰色，以表示我们对逝者的悼念。那今天讲讲几种让网站全站变灰的方法 1、修改CSS，无论是修改CSS文件，还是HTML内部写都可以 12345&lt;style type=\"text/css\"&gt;html &#123;filter: progid:DXImageTransform.Microsoft.BasicImage(grayscale=1);-webkit-filter: grayscale(100%);&#125;&lt;/style&gt; 或者 123456789body *&#123;-webkit-filter: grayscale(100%); /* webkit */-moz-filter: grayscale(100%); /*firefox*/-ms-filter: grayscale(100%); /*ie9*/-o-filter: grayscale(100%); /*opera*/filter: grayscale(100%);filter:progid:DXImageTransform.Microsoft.BasicImage(grayscale=1);filter:gray; /*ie9- */&#125; 2、HTML内嵌 12&lt;html style=\"filter: progid:DXImageTransform.Microsoft.BasicImage(grayscale=1);-webkit-filter: grayscale(100%);\"&gt; 3、JS定期自动变灰 123456789101112131415&lt;script src=\"//cdn.bootcss.com/jquery/3.4.1/jquery.min.js\"&gt;&lt;/script&gt;&lt;script&gt; var myDate = new Date; var mon = myDate.getMonth() + 1; //获取当前月 var date = myDate.getDate(); //获取当前日 var days=['4.4','5.12','7.7','9.18','12.13']; //在这里自定义日期 for (var day of days) &#123; var d=day.split('.'); if (mon == d[0] &amp;&amp; date == d[1]) &#123; var gray='grayscale(100%)'; $(\"html,body\").css(&#123;\"filter\":'gray !important;',\"filter\":\"progid:DXImageTransform.Microsoft.BasicImage(grayscale=1)\",\"filter\":gray,\"-webkit-filter\":gray,'-moz-filter':gray,'-ms-filter':gray,'-o-filter':gray&#125;); break; &#125; &#125;&lt;/script&gt;","categories":[],"tags":[]},{"title":"当我们谈论RSS时，我们谈论些什么？","slug":"当我们谈论RSS时,我们谈论些什么","date":"2020-03-12T09:32:54.000Z","updated":"2020-03-12T09:32:54.000Z","comments":true,"path":"2020/03/12/当我们谈论RSS时,我们谈论些什么/","link":"","permalink":"http://blog.hcat.work/2020/03/12/%E5%BD%93%E6%88%91%E4%BB%AC%E8%B0%88%E8%AE%BARSS%E6%97%B6,%E6%88%91%E4%BB%AC%E8%B0%88%E8%AE%BA%E4%BA%9B%E4%BB%80%E4%B9%88/","excerpt":"","text":"订阅，对于很多人来说并不是一个陌生的词汇，比如专栏订阅，公众号订阅等等，但我们今天要谈的内容是“old school”风格一些的 RSS 订阅。 对于 RSS，人们的态度是两极分化的。有的人觉得它过时老旧还难用，也有一些人以使用 RSS 为傲，他们认为身处信息洪流的时代，过滤信息的能力比收集信息更为重要，他们相信 RSS 是最高效的订阅方式。 一、RSS 为什么没落了？RSS 也曾风光无限，现如今只有一小部分 RSS 重度用户仍在使用。RSS 没落的原因我认为有两个：一是门槛高上手难度大，二是 RSS 是一种单向的服务工具。 RSS 会将网站内容转化为文本格式，这样一来，那怕你的网站设计有多么巧妙，文章排版有多么的精良，在 RSS 阅读器里统统会变成最原始的文本内容，也无法附带任何脚本语言，这使得提供内容的网站无法对运营效果做出评估，就连文章点击量+1都无法统计，其中一些网站赖以生存的广告营收也荡然无存。 从运营方的角度来说，网站其实也并不那么希望读者使用 RSS 来阅读内容，因为 RSS 难以连接内容提供者和读者，也无法平衡了内容提供者与读者之间的关系，砍去RSS订阅也成了无奈之举，就连曾经被业界”奉若神明”的 Google Reader 也是如此。 二、我们真的需要RSS吗？让我们先来看看国内的订阅方式都有哪些。 1，RSS订阅RSS订阅是互联网上最早的一种订阅方式。简单来说，以前你需要主动访问网站后才知道有没有内容更新，但有了RSS订阅后，就变成网站内容主动发送到你手上来。（缺点：门槛高难度大） 2，站内订阅站内订阅和RSS订阅有些相似，都需要用户主动订阅，但这些网站都在试图打造自己的内容闭环生态圈，因此你只能订阅该站站内的内容。比如视频订阅，微博关注，微信公众号订阅，知乎专栏关注等SNS网站。（缺点：信息孤岛效应） 3，算法推荐以算法为主要内容分发机制，通过你的浏览记录来猜测和推送你可能感兴趣的内容，比如今日头条，腾讯新闻等各大门户的新闻客户端。算法推荐可能是当下最普遍的分发机制，大多数网站和应用或多或少地都在使用。（缺点：回音室效应） 4，人工推荐人工推荐的产品更近似于传统媒体，产品的内容质量较高，同时也颇具“个人”特色，因为内容都是这些网站的编辑精选而来。比如知乎日报，湾区日报，好奇心日报，果壳精选等。（缺点：推荐内容与预期存在较大偏差） 5，算法推荐 + 人工推荐相比于算法推荐基于兴趣、领域这样的“面”信息，精准推送采用的是算法和人工编辑并重的分发机制，它为用户提供更加精确的信息，订阅的维度是“点”信息。比如即刻、一订、读读日报、轻芒阅读等。（缺点：再精准也还是无法代替人脑） [ 当我们谈论RSS时，我们谈论些什么？](https://tva1.sinaimg.cn/large/7a6a15d5gy1fz8mspx70ij21m70u07wh.jpg) 订阅就会产生「信息过载」和「回声室效应」的问题，但这些问题在 RSS 上也并没有得到完美的解决。 算法推荐常常被诟病瀑布流的内容模式容易造成了信息的过载，然而在 RSS 上，随着时间的推移和不断添加新订阅源，如果你疏于阅读清理，巨大的未阅读数量同样会造成信息过载。 算法推荐也常常被诟病，因为要迁就读者的喜好，推荐的内容会越来越狭窄，读者接受到的知识和观点也会变得片面，视野受限。同样，在 RSS 上，这种回声室效应也没有得到解决，甚至可以说更甚。因为每一条订阅源都是你自己亲自添加的，你没有理由会去添加一条你不喜欢的订阅源。 对于一个没有筛选和自控能力的人来说，RSS 订阅和其他订阅方法差别不大。就像沉迷抖音的那一群人，他们本身就是筛选能力和自控能力较弱的那一群人。 但如果你是一个有筛选和自控能力的人，RSS 对于你来说就是一种高效的阅读方式。 三、重新拥抱RSS重新拥抱RSS，用什么RSS工具比较好？ 首先，不推荐使用本地 RSS 阅读器，不能多平台使用和同步的话，RSS 容易形成「信息孤岛」，造成阅读压力。 在线 RSS 应用现如今比较知名的有两家，一家是 Feedly，一家是 Inoreader。Feedly 有着非常优雅的阅读界面，但在国内无法正常访问。Inoreader 可能是目前最广受推荐的免费在线RSS 应用，但奶酪要推荐的是另外一款新锐的在线 RSS 应用 Feeder.co。 它的总部设在瑞典，他们打着要复兴 RSS 的旗号开发了这款 RSS 应用。在我的试用体验下来，可以说，它在综合了 Feedly 和 Inoreader 优点的同时，并且加入了自己独到的创新之处。 优点： (1)，速度快，国内能正常访问，并全平台支持。(2)，节制的收费，大多数常用功能都是免费的。(3)，简洁优雅的设计，支持多种阅读模式，支持原网站框架载入。(4)，浏览器拓展十分好用，可以在拓展中直接操作。（支持 Firefox / Chrome）(5)，自动检测当前访问网站的订阅源，并支持多种通知方式。 缺点： (1)，无中文版本，界面为全英文。(2)，暂不支持在 Reeder 3 阅读器中登录。 [ feeder.co](https://tva1.sinaimg.cn/large/7a6a15d5gy1fz8lge2bdxj20sn0js113.jpg) （界面综合了 Feedly 和 Inoreader 的特色） [ feeder.co](https://tva1.sinaimg.cn/large/7a6a15d5gy1fz8jqfyfr4j20pi0j6grt.jpg) （支持在拓展中一键查询更新，支持弹窗提醒功能） 四、高效使用RSSRSS最初的愿景是让阅读变得简单，然而RSS实际使用起来并不是那么的简单。最常见的现象是订阅数量太多或者网站更新频率太高导致未阅读信息堆积如山，因此在使用 RSS 时，首先要从「做减法」上着手。 1，选择性订阅RSS 适合订阅那些不定时更新的信息源，新闻类网站因为更新频率高会导致未读消息数量庞大，而造成阅读焦虑。那些更新频率高的网站可以用浏览器的书签功能来代替。 2，人工筛选阅读第一种是通过扫标题的方法，感兴趣的全部标记为星标，接着把这个信息源下的内容全部标记为已读，然后用比较集中的时间到“星标文章”中去阅读。第二种方法是快捷键 J（下一篇文章）或者 K（上一篇文章）的方法来快速阅读，半分钟内能消化完的内容当场就读完，那些值得仔细阅读的信息则标记为星标。 3，订阅源分类对订阅源进行分类时，不建议用订阅源的类型作为分类依据，可以按照时间管理里的「四象限法则」来分类，分成「紧急重要」、「紧急不重要」和「重要不紧急」三类，对于那些「不重要不紧急」的订阅源则直接退订删除。分类文件夹名字可以使用「资讯信息」、「每日必读」和「每周必读」。 4，清理未读文章有时候难免会遇到没时间阅读RSS的情况，这时就会积攒下很多未读文章，你需要拿出「断舍离」的心态果断清理未读文章，特别是「资讯信息」这类短期内不看就不再有价值的文章。 5，定期整理订阅源如果你发现一些订阅源每天会更新很多内容但你几乎不会去阅读他们，那就可以退订阅删除他们了，不要让日益增加的未读数目成为你的阅读负担。 结尾有一个说法，说的是 “You are what you read / 你的阅读造就了你“。 你阅读什么就会成为什么样的人，你获取的信息决定了你的思维你的眼界。RSS 就像是你从茫茫的信息海洋中将宝贵的信息收集在一起，同时随着你不断更新整理其中的内容，RSS 也慢慢地变成了一本由你亲手编写的宝书。","categories":[],"tags":[]},{"title":"关于栅格化","slug":"关于栅格化","date":"2020-02-20T10:15:07.000Z","updated":"2020-02-20T10:15:07.000Z","comments":true,"path":"2020/02/20/关于栅格化/","link":"","permalink":"http://blog.hcat.work/2020/02/20/%E5%85%B3%E4%BA%8E%E6%A0%85%E6%A0%BC%E5%8C%96/","excerpt":"","text":"栅格化Grid是将向量图形格式表示的图像转换成位图以用于显示器或者打印机输出的过程。 栅（shan）格化，是PS中的一个专业术语，栅格即像素，栅格化即将矢量图形转化为位图（栅格图像）。最基础的栅格化算法将多边形表示的三维场景渲染到二维表面。 综述总体上来说，栅格化这个术语可以用于任何将向量图形转换成位图的过程。 在通常的应用中，这个术语用来表示在计算机上显示三维形状的流行渲染算法。栅格化是生成实时三维计算机图形最流行的算法。实时应用需要立即响应用户输入，并且通常需要至少每秒 24 帧的速率。 与辐射着色、光线跟踪等其它渲染技术不同，栅格化的速度非常快，但是由于它不是根据光传输的物理规律进行处理的，所以无法正确模拟许多复杂真实光照环境，只能达到足够欺骗人类眼睛的程度。 基本实现方法最基础的栅格化算法将多边形表示的三维场景渲染到二维表面。多边形由三角形的集合表示，三角形由三维空间中的三个顶点表示。在最简单的实现形式中，栅格化工具将顶点数据映射到观察者显示器上对应的二维坐标点，然后对变换出的二维三角形进行合适的填充。 变换通常使用矩阵运算进行变换，另外也可以用四元数运算但那不是本文讨论的范围。在三维顶点中添加一个齐次变量成为四维定点然后左乘一个 4 x 4 的变换矩阵，通过这种方法就可以对三维顶点进行变换。主要的变换有平移、缩放、旋转以及投射 [1] 。 平移变换是点在三维空间中从一点移动到固定偏移的另外一点的过程，平移可以用下面的矩阵表示：$$\\left[\\begin{matrix}1&amp;0&amp;0&amp;X\\0&amp;1&amp;0&amp;Y\\0&amp;0&amp;1&amp;Z\\0&amp;0&amp;0&amp;1\\\\end{matrix}\\right]$$X、Y 与 Z 分别是三维空间中的偏移。 缩放变换通过在顶点位置上乘以一个标量值实现，这样就将顶点相对于原点的位置进行缩放。缩放变换可以用下面的矩阵表示：$$\\left[\\begin{matrix}X&amp;0&amp;0&amp;0\\0&amp;Y&amp;0&amp;0\\0&amp;0&amp;Z&amp;0\\0&amp;0&amp;0&amp;1\\\\end{matrix}\\right]$$其中 X、Y 与 Z 是三维坐标中每一维所乘的数值。通过使用不同的 X、Y、Z 值可以实现不对称缩放。 旋转变换是绕着一个轴线对每点进行旋转。 绕 X 轴旋转：$$\\left[\\begin{matrix}1&amp;0&amp;0&amp;0\\0&amp;\\cos\\theta&amp;-\\sin\\theta&amp;0\\0&amp;\\sin\\theta&amp;\\cos\\theta&amp;0\\0&amp;0&amp;0&amp;1\\\\end{matrix}\\right]$$绕 Y 轴旋转：$$\\left[\\begin{matrix}\\cos\\theta&amp;0&amp;\\sin\\theta&amp;0\\0&amp;1&amp;0&amp;0\\-\\sin\\theta&amp;0&amp;\\cos\\theta&amp;0\\0&amp;0&amp;0&amp;1\\\\end{matrix}\\right]$$绕 Z 轴旋转：$$\\left[\\begin{matrix}\\cos\\theta&amp;-\\sin\\theta&amp;0&amp;0\\\\sin\\theta&amp;\\cos\\theta&amp;0&amp;0\\0&amp;0&amp;1&amp;0\\0&amp;0&amp;0&amp;1\\\\end{matrix}\\right]$$其中 θ 表示旋转角度。 逻辑上一系列的平移、缩放、旋转可以表示绝大多数的变换。通常栅格化系统使用变换栈将输入顶点的数据流变换到指定位置，变换栈是保存矩阵的标准堆栈，输入顶点与矩阵栈相乘进行变换。 为了说明如何使用变换栈，我们假设有一个简单场景中只有一个人的模型。这个人在一个特定位置面向任意一个角度竖直站立，头转向另外一个方向。使用一系列的顶点与模型用来表示这个人物。首先，将一个变换矩阵压到堆栈中将模型移到正确的位置；其次，将缩放矩阵压到堆栈中将模型缩放到正确的尺寸；然后，表示身体的顶点数据流送到栅格化工具中；由于头部面向另外一个方向，将旋转矩阵从堆栈弹出，压入一个绕 Y 轴旋转一个不同角度的旋转矩阵；最后，表示头部的顶点数据流送到栅格化工具。 在所有点都已经变换到相对于观察者的合适三维空间位置之后，就需要将它们变换到二维空间了。最简单的投影方法正投影简单地从变换的三维顶点中扔掉 Z 分量。正投影的特点是三维空间中的平行线在二维表示中仍然平行。但是，真实世界中的图像都是透视图像，离观察者较远的点之间的距离看起来要比较近点之间的距离近，这些点都要进行透视投影变换 [2] 。 从概念上来讲就是将透视体转变成正视体。透视体是平截头体，即被截去头部的金字塔体。正视体是一个矩形盒，其中远近两个观察面都与图像平面平行 [3] 。 透视投影变换可以用下面的矩阵表示：$$\\left[\\begin{matrix}1&amp;0&amp;0&amp;0\\0&amp;1&amp;0&amp;0\\0&amp;0&amp;(N+F)/N&amp;-F\\0&amp;0&amp;1/N&amp;0\\\\end{matrix}\\right]$$其中 F 与 N 分别是观察面的远近距离。四个结果向量是一个齐次变量不是 1 的向量。对向量进行齐次变换，或者乘以齐次变量的逆，齐次变量变为单位矩阵，这就是最终二维位置的 x 与 y 坐标。 裁剪一旦三角形顶点转换到正确的二维位置之后，这些位置可能位于观察窗口之外，也可能位于屏幕之内。裁剪就是对三角形进行处理以适合显示区域的过程。 最常用的技术是Sutherland-Hodgeman裁剪算法。在这种方法中，每次测试每个图像平面的四条边，对于每个边测试每个待渲染的点。如果该点位于边界之外，就剔除该点。对于与图像平的面边相交的三角形边，即边的一个顶点位于图像内部一个位于外部，那么就在交叉点插入一个点并且移除外部的点。 扫描变换传统的栅格化过程的最后一步就是填充图像平面中的二维三角形，这个过程就是扫描变换。 第一个需要考虑的问题就是是否需要绘制给定的像素。一个需要渲染的像素必须位于三角形内部、必须未被裁掉，并且必须未被其它像素遮挡。有许多算法可以用于在三角形内进行填充，其中最流行的方法是扫描线算法。 由于很难确定栅格化引擎是否会从前到后绘制所有像素，因此必须要有一些方法来确保离观察者较近的像素不会被较远的像素所覆盖。最为常用的一种方法是深度缓存，深度缓存是一个与图像平面对应的保存每个像素深度的二维数组。每个像素进行绘制的时候都要更新深度缓存中的深度值，每个新像素在绘制之前都要检查深度缓存中的深度值，距离观察者较近的像素就会绘制，而距离较远的都被舍弃。 为了确定像素颜色，需要进行纹理或者浓淡效果计算。纹理图是用于定义三角形显示外观的位图。每个三角形顶点除了位置坐标之外都与纹理以及二维纹理坐标 (u,v) 发生关联。每次渲染三角形中的像素的时候，都必须在纹理中找到对应的纹素，这是根据在屏幕上像素与顶点的距离在与纹理坐标相关联的三角形顶点之间插值完成的。在透视投影中，插值是在根据顶点深度分开的纹理坐标上进行的，这样做就可以避免透视缩减（perspective foreshortening）问题。 在确定像素最终颜色之前，必须根据场景中的所有光源计算像素上的光照。在场景中通常有三种类型的光源。定向光是在场景中按照一个固定方向传输并且强度保持不变的光。在现实生活中，由于太阳距离遥远所以在地球上的观察者看来是平行光线并且其衰减微乎其微，所以太阳光可以看作是定向光。点光源是从空间中明确位置向所有方向发射光线的光源。在远距离的物体上的入射光线会有衰减。最后一种是聚光灯，如同现实生活中的聚光灯一样，它有一个明确的空间位置、方向以及光锥的角度。另外，经常在光照计算完成之后添加一个环境光值以补偿光栅化无法正确计算的全局照明效果。 有许多可以用于光栅化的浓淡算法。所有的浓淡处理算法都必须考虑与光源的距离以及遮蔽物体法向量与光照入射角。最快的算法让三角形中的所有像素使用同样的亮度，但是这种方法无法生成平滑效果的表面。另外也可以单独计算顶点的亮度，然后绘制内部像素的时候对顶点亮度进行插值。速度最慢也最为真实的实现方法是单独计算每点的亮度。常用的浓淡模型有 [Gouraud shading](https://baike.baidu.com/item/Gouraud shading) 和 Phong shading。 加速技术为了在任何栅格化引擎中获得最大的性能，只能往渲染工具中发送最少数量的多边形。人们已经开发出了一些加速技术以剔除无法看到的物体。 后向剔除最简单的剔除多边形的方法就是剔除所有背离观察者的多边形，这就是后向剔除。由于大多数三维物体都是封闭的，所以除非观察者位于物体内部，背离观察者的多边形都会被面向观察者的多边形所遮挡。多边形的方向由它的旋绕方向（winding）或者送到渲染工具的顶点顺序所确定。一旦多边形变换到屏幕空间之后，就可以检查它是否位于相反的方向，一旦如此就丢弃这个多边形。当然，后向剔除不适合于简并的不封闭立体。 空间数据结构许多先进的技术使用数据结构提出观察物体之外的物体或者被其它物体遮挡的物体，最为常用的数据结构有二元空间分割、八叉树以及单元和入口裁剪。 改进方法尽管基本的栅格化过程已经出现了数十年，许多当今的应用仍然在优化、增加栅格化渲染引擎的应用范围。 纹理映射纹理是在特定的分辨率生成的，但是由于纹理覆盖的表面与观察者之间可能是任意的距离，所以纹理也可能最后图像上有任意的尺寸。因此，屏幕上的一个像素通常并不直接对应于一个纹素，而是需要使用一些纹理滤波技术来生成任意距离的清晰图像。有许多在图像质量与计算的复杂性进行不同这种考虑的方法可以完成这项工作。 环境映射环境映射是纹理坐标与观察点相关的纹理映射形式。例如，其中一个常用的应用程序就是用来模拟镜面反射，我们可以将整个房间内部环境映射到房间内的一个金属杯上，当观察者沿着杯子移动的时候，杯子顶点的纹理坐标也随之变化，这样就得到反射效果。 凸凹纹理映射凸凹纹理映射是改变像素深度而不是颜色的另外一种纹理映射形式。尤其是与最新的阴影工具一起使用的时候，凸凹纹理映射使得表面显现出与光照有关的凸凹不平，从而大幅度地提高真实感。 细节层次在许多当今的应用中，任何场景中的多边形数目都是非常大的，但是场景中的观察者只能区分近距物体的细节。细节层次算法根据物体与观察者的距离改变几何图形的复杂性。正对着观察者的物体需要进行非常复杂的渲染，而距离远的物体可以动态地简化，甚至可以完全适用二维 sprite 替代 [4] 。 阴影传统栅格化过程的光照计算没有考虑物体遮挡的因素。阴影图与阴影体是当今两种生成阴影的普通技术。","categories":[],"tags":[]},{"title":"拽姐日记","slug":"拽姐日记","date":"2019-11-13T12:01:35.000Z","updated":"2019-11-13T12:01:35.000Z","comments":true,"path":"2019/11/13/拽姐日记/","link":"","permalink":"http://blog.hcat.work/2019/11/13/%E6%8B%BD%E5%A7%90%E6%97%A5%E8%AE%B0/","excerpt":"","text":"你算什么东西，凭什么看姐日记","categories":[],"tags":[{"name":"随笔","slug":"随笔","permalink":"http://blog.hcat.work/tags/%E9%9A%8F%E7%AC%94/"}]},{"title":"vscode所在路径","slug":"vscode所在路径","date":"2017-08-04T05:08:13.000Z","updated":"2017-08-04T05:08:13.000Z","comments":true,"path":"2017/08/04/vscode所在路径/","link":"","permalink":"http://blog.hcat.work/2017/08/04/vscode%E6%89%80%E5%9C%A8%E8%B7%AF%E5%BE%84/","excerpt":"","text":"1C:\\Users\\Administrator\\AppData\\Roaming\\Code","categories":[],"tags":[{"name":"随笔","slug":"随笔","permalink":"http://blog.hcat.work/tags/%E9%9A%8F%E7%AC%94/"}]},{"title":"Welcome to Hcat Blog!","slug":"test","date":"2016-11-15T16:02:39.000Z","updated":"2016-11-16T01:25:50.000Z","comments":true,"path":"2016/11/16/test/","link":"","permalink":"http://blog.hcat.work/2016/11/16/test/","excerpt":"","text":"Welcome to Hcat Blog! This is my very first post. 极速入门新建一篇文章1$ hexo new \"My New Post\" More info: Writing 运行服务1$ hexo server More info: Server 生成站点文件1$ hexo generate More info: Generating 远程部署到站点1$ hexo deploy More info: Deployment","categories":[],"tags":[]}],"categories":[],"tags":[{"name":"文章","slug":"文章","permalink":"http://blog.hcat.work/tags/%E6%96%87%E7%AB%A0/"},{"name":"随笔","slug":"随笔","permalink":"http://blog.hcat.work/tags/%E9%9A%8F%E7%AC%94/"}]}